IDEA StatiCa Open Model
OpenModel.Settlements Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Settlements in this load case
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<Settlement> Settlements { get; set; }
Public Property Settlements As List(Of Settlement)
	Get
	Set
public:
property List<Settlement^>^ Settlements {
	List<Settlement^>^ get ();
	void set (List<Settlement^>^ value);
}
Property Value
Type: List<Settlement>
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace